![](https://assets.datacamp.com/production/course_13367/shields/original/shield_image_course_13367_20200118-1-cwkw1p?1579372751)

### **DATABASE CREATION AND CONNECTING IT**

#### **Just run next 4 cells**

In [1]:
## JUST RUN THIS CELL
import sqlite3
import pandas as pd

In [2]:
# run this to create and connect to database
connection = sqlite3.connect('cloud.db')

In [3]:
# load sql extension
%load_ext sql

In [4]:
# connecting to cloud.db
%sql sqlite:///cloud.db

## **NOW WE WILL CREATE TABLES AND INSERT DATA**

##### **RUN NEXT 6 CELLS TO CREATE TABLE AND INSERT DATA**

In [5]:
%%sql

CREATE table pieces (Code int(16), Name varchar(25))

 * sqlite:///cloud.db
Done.

[]

In [6]:
%%sql

INSERT INTO pieces (Code, Name) VALUES(1, 'Sprocket'), (2, 'Screw'), (3, 'Nut'), (4, 'Bolt'), (5, 'Bat'), (6, 'Ball'), (7, 'Wood'), (8, 'Bed'), (9, 'Plate')

 * sqlite:///cloud.db
9 rows affected.

[]

In [7]:
%%sql

CREATE table providers (Code varchar(10), Name varchar(50))

 * sqlite:///cloud.db
Done.

[]

In [8]:
%%sql

INSERT INTO providers (Code, Name) VALUES('HAL', 'Clarke Enterprises'), ('RBT', 'Susan Calvin Corp.'),
 ('SNBC', 'Bellington Supplies'), ('TNBC', 'Skellington Supplies'), ('TNPSC', 'Tellington Supplies')

 * sqlite:///cloud.db
5 rows affected.

[]

In [9]:
%%sql

CREATE table provides (Piece int, Provider varchar(25), Price int)

 * sqlite:///cloud.db
Done.

[]

In [10]:
%%sql

INSERT INTO provides (Piece, Provider, Price) VALUES(1, 'HAL', 10), (1, 'RBT', 15), (2, 'HAL', 20),
 (2, 'RBT', 15), (2, 'TNBC', 14), (3, 'RBT', 50), (3, 'SNBC', 45), (4, 'HAL', 5), (4, 'TNPSC', 7)

 * sqlite:///cloud.db
9 rows affected.

[]

#### **YOUR TASK STARTS FROM HERE**

##### **NOTE** - Do not remove magic command %%sql as it will throw error without it.

<b>1. display the  table "pieces" </b>.

In [11]:
%%sql
select * from pieces

 * sqlite:///cloud.db
Done.

[(1, 'Sprocket'),
 (2, 'Screw'),
 (3, 'Nut'),
 (4, 'Bolt'),
 (5, 'Bat'),
 (6, 'Ball'),
 (7, 'Wood'),
 (8, 'Bed'),
 (9, 'Plate')]

<b>2.display the table "providers"</b>

In [12]:
%%sql
select * from providers

 * sqlite:///cloud.db
Done.

[('HAL', 'Clarke Enterprises'),
 ('RBT', 'Susan Calvin Corp.'),
 ('SNBC', 'Bellington Supplies'),
 ('TNBC', 'Skellington Supplies'),
 ('TNPSC', 'Tellington Supplies')]

<b>3.diplay the table "provides"</b>

In [13]:
%%sql
select * from provides

 * sqlite:///cloud.db
Done.

[(1, 'HAL', 10),
 (1, 'RBT', 15),
 (2, 'HAL', 20),
 (2, 'RBT', 15),
 (2, 'TNBC', 14),
 (3, 'RBT', 50),
 (3, 'SNBC', 45),
 (4, 'HAL', 5),
 (4, 'TNPSC', 7)]

<b>4. select the name of all the pieces</b>

In [14]:
%%sql
select name from pieces

 * sqlite:///cloud.db
Done.

[('Sprocket',),
 ('Screw',),
 ('Nut',),
 ('Bolt',),
 ('Bat',),
 ('Ball',),
 ('Wood',),
 ('Bed',),
 ('Plate',)]

<b>5.Obtain the average price of each piece (show only the piece code and the average price)</b>

#### **`Check this to see about avg keyword`**-https://www.w3schools.com/sql/sql_count_avg_sum.asp

In [15]:
%%sql
select Piece , avg(Price) as Avg_Price from provides group by Piece

 * sqlite:///cloud.db
Done.

[(1, 12.5), (2, 16.333333333333332), (3, 47.5), (4, 6.0)]

<b>6. Obtain the names of all providers who supply piece=1
    
  (i)using subquery</b>

#### **`Check this for subquery in sql :`** https://www.w3resource.com/sql/subqueries/understanding-sql-subqueries.php

In [18]:
%%sql

select providers.name as Name from providers, provides where providers.code = provides.provider AND provides.piece = (select piece from provides where piece =1)

 * sqlite:///cloud.db
Done.

[('Clarke Enterprises',), ('Susan Calvin Corp.',)]

<b>

(ii) without using subquery</b>

In [19]:
%%sql
select providers.name as Name from providers, provides where providers.code = provides.provider AND provides.piece = 1

 * sqlite:///cloud.db
Done.

[('Clarke Enterprises',), ('Susan Calvin Corp.',)]

<b>7. Select the name of pieces provided by provider with code "HAL"
    
      (i) without using exists

In [21]:
%%sql
select p.name as Name from pieces p , provides pr where p.code = pr.piece AND pr.provider = 'HAL'

 * sqlite:///cloud.db
Done.

[('Sprocket',), ('Screw',), ('Bolt',)]

<b> (ii) using 'exists'</b>

#### **`Check this for exists operator:`** https://www.w3schools.com/sql/sql_exists.asp

In [22]:
%%sql

Select name as Name from pieces where Exists(select provider from provides where provides.piece = pieces.code AND provides.provider = 'HAL')

 * sqlite:///cloud.db
Done.

[('Sprocket',), ('Screw',), ('Bolt',)]

<b>8.For each piece, find the most expensive offering of that piece and include the piece name, provider name, and price 

  (note that there could be two providers who supply the same piece at the most expensive price).</b>

#### **`Check this for inner join in sql:`** https://www.w3schools.com/sql/sql_join_inner.asp

In [29]:
%%sql
select pieces.Name as Name, providers.Name as Name_1 , max(provides.Price) as Price from ((pieces inner join provides on  
provides.piece = pieces.code) inner join providers on providers.code = provides.provider) group by pieces.Name 
order by pieces.Name desc

 * sqlite:///cloud.db
Done.

[('Sprocket', 'Susan Calvin Corp.', 15),
 ('Screw', 'Clarke Enterprises', 20),
 ('Nut', 'Susan Calvin Corp.', 50),
 ('Bolt', 'Tellington Supplies', 7)]

<b>9.Add an entry to the database to indicate that "Skellington Supplies" (code "TNBC") will provide sprockets (code "1") for 7 cents each</b>

In [30]:
%%sql

Insert into provides values (1 , "TNBC" , 7)

 * sqlite:///cloud.db
1 rows affected.

[]

<b>10.Increase all prices by one cent.</b>

In [31]:
%%sql
update provides set price = price + 1

 * sqlite:///cloud.db
10 rows affected.

[]

<b>11 Update the database to reflect that "Susan Calvin Corp." (code "RBT") will not supply bolts (code 4).

In [50]:
%%sql
DELETE FROM provides WHERE provider = "RBT" and piece = 4;

 * sqlite:///cloud.db
0 rows affected.

[]

In [55]:
%%sql
select * from provides

 * sqlite:///cloud.db
Done.

[(1, 'HAL', 11),
 (2, 'HAL', 21),
 (2, 'TNBC', 15),
 (3, 'SNBC', 46),
 (4, 'HAL', 6),
 (4, 'TNPSC', 8),
 (1, 'TNBC', 8)]

<b>12.Update the database to reflect that "Susan Calvin Corp." (code "RBT") will not supply any pieces(the provider should still remain in the database).</b>

In [51]:
%%sql

DELETE FROM provides WHERE provider = "RBT"

 * sqlite:///cloud.db
3 rows affected.

[]

<b>13 combine column "code" from pieces and "name" from providers using union </B>

#### **`Check this for union operator:`** https://www.w3schools.com/sql/sql_union.asp

In [52]:
%%sql
SELECT code FROM pieces
UNION
SELECT name FROM providers;

 * sqlite:///cloud.db
Done.

[(1,),
 (2,),
 (3,),
 (4,),
 (5,),
 (6,),
 (7,),
 (8,),
 (9,),
 ('Bellington Supplies',),
 ('Clarke Enterprises',),
 ('Skellington Supplies',),
 ('Susan Calvin Corp.',),
 ('Tellington Supplies',)]

<b>14.select column piece and provider and groupby piece </b>

In [79]:
%%sql
select count(piece), provider from provides  group by piece

 * sqlite:///cloud.db
Done.

[(2, 'HAL'), (2, 'HAL'), (1, 'SNBC'), (2, 'HAL')]

<b>15. write a query to select codes, name, price of company whose piece prices are more than 20 cents. </b>

In [81]:
%%sql
select providers.code as Code , providers.Name as Name , provides.Price as Price from providers , provides where provides.Price > 20 and
provides.provider = providers.code

 * sqlite:///cloud.db
Done.

[('HAL', 'Clarke Enterprises', 21), ('SNBC', 'Bellington Supplies', 46)]

# **Feedback Form** #
https://docs.google.com/forms/d/e/1FAIpQLScnAaAKvph9R3vINyCtOOMiav-tSMsRGlJReMaHyPjsXDlTIA/viewform